Revit 2024 API
BendingDetailDisplayParametersOptions Enumeration
 Describes how the parameters will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum BendingDetailDisplayParametersOptions
Visual Basic
Public Enumeration BendingDetailDisplayParametersOptions
Visual C++
public enum class BendingDetailDisplayParametersOptions
Members
Member name | Description
ByValue |  Dimensions that are shown will be labeled using the parameters values.
ByName |  Dimensions that are shown will be labeled using the parameters names.
See Also
Autodesk.Revit.DB.Structure Namespace